{
    "home": {
        "mainPara" : "The Concurrent Software Engineering Laboratory (CSEL) performs research activities in modeling, design, development, and analysis of concurrent software systems, including parallel and distributed computing systems. This includes research in distributed software engineering, formal methods, flexible manufacturing systems, workflow management systems, web services, and multi-agent systems.",
        "subParas" : [
          {"point": "The research work in distributed software engineering covers many topics related to requirements specification and analysis, architecture design, verification and validation. Areas of focus include design and analysis methods for distributed object systems, parallel algorithms, multi-agent software, performance metrics for concurrency models, and techniques and tools for testing of concurrent software systems."},
          {"point": "One area of emphasis is the theory and applications of <a href='http://www.informatik.uni-hamburg.de/TGI/PetriNets/' target='_blank'>Petri Nets</a>, a formal graph model for concurrency and coordination by using various forms of Petri nets and automata, including systems that require annotations of time, costs, and resource allocation."},
          {"point": "Study of structural and behavioral properties of Petri net morphisms and their applications in analysis, decomposition, and synthesis of concurrent systems is part of a broader interest in formal conceptual modeling of parallel and distributed systems. Another interest is in efficient parallelization of sequential algorithms or programs."},
          {"point": "Part of the research in verification seeks new approaches to improve the effectiveness of automated system verification using temporal logic and model checking algorithms."},
          {"point": "Research in service-oriented computing includes model-based service composition, mobile cloud computing, agent-based web services, and web services security."},
          {"point": "Research related to multi-agent systems focuses on model-based agent development and agent-oriented software engineering. Some specific research issues in this area include formal specification and prototyping of multi-agent systems; model-based development of agent-oriented software, including design and implementation of software agents; and real-world applications of agent technology."}
        ]
    },
    
    "publications": {
    },
    
    "grantActivities": [
      {"point": "PI: Haiping Xu, NSF Grant, \"CT-ISG: Agent-Based Trust Management for Trust Re-Evaluation in Online Auctions,\" Collaborative Research with University of Illinois at Chicago, August 2007 – July 2010 (Project Home Page)."},
      {"point": "PI: Haiping Xu, Co-PI: Ramprasad Balasubramanian, Marine Corps Grant, \"Ontology-Based Dynamic Service Discovery for Fault-Tolerant Service-Oriented Systems,\" May 2008 – October 2008."},
      {"point": "PI: Haiping Xu, Chancellor’s Research/UMass Healey Endowment Grants, \"State-Based XML Firewall for Service-Oriented Systems,\" July 2007 – June 2008 (Project Home Page)."},
      {"point": "PI: Haiping Xu, Research Seed Initiative Fund (RSIF), \"Agent-Based Trustworthy Service-Oriented Architecture,\" July 2007 – June 2008."},
      {"point": "PI: Haiping Xu, Chancellor’s Research/UMass Healey Endowment Grants, \"A Trustworthy Agent Based Online Auction System,\" July 2006 – June 2007."},
      {"point": "PI: Haiping Xu, Co-PI: Xiaoqin Zhang, Research Seed Initiative Fund (RSIF), \"Prototyping Role-Based Large Scale, Complex Multi-Agent Applications,\" February 2005 – January 2006 (Project Home Page)."}
    ],
    
    "contactInfo": {
      "director": "Dr. Haiping Xu",
      "staff": [
        {"point": "Lab Manager: Jean F. Rahme (Email: jrahme@umassd.edu)"},
        {"point": "Technician: Paul Naylor (Email: pnaylor@umassd.edu)"},
        {"point": "Former Lab Manager: Arturo Li (graduated in May 2013)"}
      ],
      "location": [
        {"point": "101C Textile Building"},
        {"point": "285 Old Westport Rd."},
        {"point": "University of Massachusetts Dartmouth"},
        {"point": "(508) 910-6285"}
      ]
    }
}
